<h1>Задания семинара 9 (4 балла)</h1>

<h2>1. Обработка строковых данных (3 задания)</h2>

<h3>Задания</h3>

<ol>
    <li>
        <strong>Напишите программу перевода введенной строки в требуемый регистр (0,5 балла)</strong>
        <p>В программе должна вводиться строка, затем выбираться требуемый регистр, ввод 0 означает нижний регистр, ввод 1 означает верхний регистр.</p>
        <p>Используйте функции: <code>toupper</code>, <code>tolower</code>, <code>strlen</code>.</p>
        <p>Организуется цикл: <code>for(int i=0; i < strlen(str); i++) …;</code></p>
        <p>Для ввода строки используйте функцию <code>scanf_s</code> или поток ввода <code>cin</code>.</p>
    </li>

<p></p>
    <li>
        <strong>Напишите программу, переворачивающую введенную фразу (0,5 балла)</strong>
        <p>Например, введено: <code>жили у бабуси три веселых гуся</code></p>
        <p>Программа должна вывести: <code>ясуг хылесев ирт исубаб у илиж</code></p>
        <p>Подсказка: используйте функцию <code>strlen</code> и работайте со строкой, как с массивом в цикле от 0 до половины размера строки. Заменяйте символы зеркально относительно центра строки, используйте дополнительную переменную типа <code>char</code> для временного хранения символа при замене.</p>
    </li>
<p></p>
    <li>
        <strong>Напишите программу, переворачивающую слова во введенной фразе (1 балл)</strong>
        <p>Например, введено: <code>жили у бабуси три веселых гуся</code></p>
        <p>Программа должна вывести: <code>илиж у исубаб ирт хылесев ясуг</code></p>
        <p>Подсказка: используйте функцию <code>strtok_s</code> для выделения слов из строки, затем переворачивайте слова и вставляйте на место или используйте индексы выделенного слова в цикле замены.</p>
    </li>
</ol>

<h2>2. Программа работы с массивом (2 балла)</h2>

<h3>Задание</h3>

<p>На основе разработанной ранее библиотеки работы с одномерным массивом создайте программу, содержащую следующее меню (используя оператор <code>switch</code>):</p>

<ol>
    <li>Создать массив</li>
    <li>Ввести массив</li>
    <li>Найти максимум</li>
    <li>Найти сумму</li>
    <li>Отсортировать</li>
    <li>Вывести массив</li>
    <li>Удалить массив</li>
    <li>Выход из программы</li>
</ol>

<p>Пункты 2 и 7 становятся активными только после выбора пункта 1 (создание массива) и снова становятся неактивными после его удаления в пункте 7).</p>
<p>Пункт 1 становится неактивным после создания массива, после удаления массива снова активен.</p>
<p>Пункты 3-6 становятся активными только после ввода массива, после удаления массива снова неактивны.</p>

<p>Для активации пунктов меню используйте переменные типа <code>bool</code> и устанавливайте значения <code>true</code>/<code>false</code> как активное/неактивное. При выводе меню проверяйте значения и делайте соответствующие пункты неактивными.</p>

<h3>Пример использования <code>strtok_s</code></h3>

```
#define MAX_STR_SIZE 80		// задаем максимальный размер для буфера строки
char str[MAX_STR_SIZE];		// буфер для хранения строки
char* tokens;			// указатель на массив токенов для strtok_s
char separators[] = " \t\n\r";	// массив разделителей слов

cout << "Вводите строку" << endl;
cin.getline(str, MAX_STR_SIZE);
char* cur_lex = strtok_s(str, separators, &tokens); // начинаем выделять слова
while (cur_lex != NULL) // если в строке еще есть слова, то продолжаем
{
	// cur_lex содержит очередное слово
	cout << cur_lex << endl; // выводим слово из cur_lex на экран

	// получаем следующее слово в cur_lex
	cur_lex = strtok_s(NULL, separators, &tokens);
}
```
